import PageSectionWrapper from "../PageSectionWrapper/PageSectionWrapper";
import historyImg from '../../assets/img/history.png'
import {Col,Row} from "react-bootstrap";

const AboutBlock = () => {
    return (
        <PageSectionWrapper id={"about"}>
            <Row className={"gy-3"} data-aos="fade-in">
                <Col xs={12}>
                    <h6 data-aos="slide-up" className="sb-text-image__content-title">Історія Теребовлі
                    </h6>

                    <img  src={historyImg} alt=""/>
                        </Col>
                <Col  xs={12} data-aos="slide-up">
                    <div ><p>Точного року, коли було засноване місто
                        ніхто не може сказати, але перша письмова згадка датується за часів князювання <strong>Василька
                            Теребовлянського</strong> у 1097 році.</p><p>У другій половині XIV століття місто було
                        захоплене <strong>Казимиром ІІІ </strong> та увійшло до складу Польського королівства а згодом і
                        Речі Посполитої.</p><p>У 1389 році король <strong>Владислав Ягайло</strong> надає Теребовлі
                        Магдебурзьке право, яке допомагало створювати умови для розвитку ремесел та торгівлі, що у свою
                        чергу, сприяло збільшенню місцевого населення.</p><p>Протягом наступних 400 років, Теребовля
                        залишалась форпостом Речі Посполитої від турецької навали аж до 1698 року.</p><p>У 1772 році,
                        після першого поділу Польщі, край опиняється у складі Австрійської імперії. А у 1777
                        австрійський уряд анульовує Магдебурське право у місті.</p><p>Наприкінці XIX століття, у час
                        коли інтенсивно розвивалось будівництво автодоріг та залізничних колій, на околицях Теребовлі
                        з'являються 2 залізничні мости - віадуки. </p><p>У вересні 1939 року, місто переходить до складу
                        Радянського союзу, після чого почались масові репресії та гоніння проукраїнських настроїв. Було
                        знищено, закатовано тисячі та ще більше вивезено у концтабори. На "очищених територіях" почали
                        будувати індустріалізоване місто, тут з'явились і взуттєва фабрика, маслозавод та фабрика
                        ялинкових прикрас.</p><p>23 травня 1990 року над міською ратушею офіційно піднято синьо-жовтий
                        прапор. Після здобуття незалежності люди знову заговорили про свободу, демократію та історію
                        рідного краю.</p><p>У продовж цього часу Теребовля поступово розвивалась та активно шукала
                        європейських міст-партнерів. Сьогодні через місто проходять важливі автомобільні та залізничні
                        шляхи міжнародного значення, а Теребовля є маленьким українським містечком, яке будує Європу у
                        себе вдома.</p></div>
                </Col></Row>

        </PageSectionWrapper>
    );
};

export default AboutBlock;
